
# 面试官 Hunag jie -- techlead mgr
# 素质不错，技术强，技术不match

# 50人+，5个 team 
# 1   4个后端
#         infra devops工具链/中间件  解决方案 不做服务化（评审），对使用方
#         Saas计费
#         设备管理
#         设备接入Golang
# 2   云平台前端

# 海外有toC零售业务，toB的商用解决方案，包含通讯产品、消费电子产品这种

#   我这边的团队是运营商业务，客户是海外运营商，合作开发定制化通讯产品，
#   他们把产品卖给个人用户，上海承接的是设备管理云平台开发

# TPLink 联洲国际（只做海外市场）
#   SH 办公室刚成立，22-3、4月份
#   设备制造公司
#   严格打卡 SH 9-6-5 1.5h

# 业务
#     toB（SH）解决方案，客户是运营商，管理运营商在家管理的路由器，以及管理的设备
#       整个团队都在上海
#       出差机会海外？海外需要support的（新加坡，美国）

#     toC（SZ）

#     路由器品牌 TP-Link 联洲 海外业务，欧美零售的运营商，欧美商差异，Tmobile Sprint采购设别
#         toB市场 3-4 年
#         部署在aws 新加坡和美国的aws（业务合规性）

# 云平台，技术栈
#     golang =》 长连接，托管设备云端发起连接，设备接入网关（100W 设备 =》3-5年 1000W）
#         高并发，规模大
#     Java =》 面向运营商的管理端，运营商是主要客户
#         同厂商 Plume, 华为云平台


# ##########################################################################
# 一面 纯电话

#   DDD 和传统的 传统存储数据分层DAO有什么区别

#     领域驱动设计（DDD）中，数据分层DAO（数据访问对象）与传统的分层DAO存在一些区别。
#     DDD强调将业务逻辑与数据访问分离，因此，数据分层DAO通常更加注重领域模型的设计，以满足业务需求。传统的分层DAO可能更倾向于简单的数据持久化和访问。

#   中间件 kafka
#       中间建kafka的rebalance是什么？什么情况发生？对使用的影响？

#       新的consumer加入是什么case

#       kafka的partition和消费者的比例关系

#       rebalance怎么处理


#   git分支管理方式？ 

#       分支拉出的动作需要注意什么

#       两个人同时开发冲突怎么处理

