
# 第一次HR面试robinhood居然在onsite之前就要和HR聊，完全没有经验聊得非常尴尬无趣。
# 结果就是他说他的介绍完之后我只能说不错不错，互动环节非常尴尬，
# 而且最后问期待的薪资待遇这一步也是非常没有经验感觉被他套话。

# ！！！相对于new grad求职，以后再职场跳槽估计更多会先和HR打交道谈妥之后才有技术面试，归纳下大致思路为以后用。

# HR的问题主要是check your behavior and know your expectation

    # 公司介绍 + 项目信息   
    # 	 无非就是介绍他们公司做什么内容大致有什么team的分布，在了解我的项目内容和，了解我选组的意愿，以及为什么match这家组（理由）？
    # 	这部分主要是HR自己介绍，我主要是等他blabla讲完再表达意向。
        
    # 为什么选择这家公司   + 找工作时最看重什么 ？    
    # 	结合公司特点回答，根据公司招人的意向来决定？ 
    # 		如果是快速发展的startup说 寻求新的技术和挑战，可以有更多锻炼成长的空间。
    # 		如果是稳定的大厂可以往work life balance 或者 新的项目组？
    # 	这部分主要是看怎么说到和公司招人和发展match的水平上。

    # 预期薪资 （sigon + base + stock）
    # 	这个是最缺乏聊天经验。
    # 	- package永远是在有strong hire的result之后才能谈得来，面试的strong hire result可以对HR施压，以至于在可接受范围内都是可以谈的。一般涨rsu或者bonus不一定会长base。
    # 	- HR不会给出自己的一个报价并且会反复问我的预期具体工资，需要参考谈判学的知识:  不着急给出自己的价码，也切忌暴露任何其他offer的具体信息，这样才有多个offer之间抬杠的可能性，差不多到达预期价位再收。
